####9과 자습
#9.1
# # def func(x) :
# #    # 코드 작성
# #    if type(x) == str:
# #       return len(x)
# #    elif type(x) == int:
# #       return x**2
# #    elif type(x) == float:
# #       return round(x)
# #    else:
# #       return "ERROR"
    
# # t = ('kim', 'willtek', '1234', 1234, -3.14, ('python',), 'hello')
# # x = map(func, t)
# # print(*x)

# def func(x) :
#    # 코드 작성
#    if isinstance(x, str):
#       return len(x)
#    elif isinstance(x, int):
#       return x**2
#    elif isinstance(x, float):
#       return round(x)
#    else:
#       return "ERROR"
    
# t = ('kim', 'willtek', '1234', 1234, -3.14, ('python',), 'hello')
# x = map(func, t)
# print(*x)


###9.2
# def remove(l, n) :
#      # 코드 작성
#     return [x for x in l if x != n]
    
# l = [int(x) for x in input().split()]
# n = int(input())
# print(*remove(l, n))

# ###9.3
# s = input()
# t = input()

# #idx = len(s)
# cnt=0
# for i in range(len(s)-len(t)+1):
#     if (s[i:i+len(t)] == t):
#         cnt +=1
# print(cnt)


#####자습########

##4과 자습##
# #4-1
# n = int(input())
# x = [0] * n
# print(x)

# #4-2
# l = input().split(',')
# l.reverse()
# print(*l, sep='-')

# #4-3
# n = list(map(int, input().split()))
# m = int(input())

# print(m in n)

# #4-4 룩업 테이블 만들기 딕셔너리
# n = list(map(int, input().split()))
# m = int(input())
# d= {True:"GOOD", False:"BAD"}
# r= d[m in n]
# print(r)





# 코드 작성

############################################################
# [A-1] 천만까지 합 구하기
############################################################

# import datetime

# tot = 0
# start = datetime.datetime.now()

# for i in range(10000001): tot += i

# end = datetime.datetime.now()
# print("time =", (end - start), tot)

############################################################
# [A-2] 천만까지 합 구하기
############################################################

# import datetime

# start = datetime.datetime.now()

# tot = sum(range(10000001))

# end = datetime.datetime.now()
# print("time =", (end - start), tot)

############################################################
# [1-1] Hello Python
############################################################

# print('Hello')
# print("Python")
# print('홍길동', '나이 =', 20, "세")

############################################################
# [1-2] 파이썬의 주석
############################################################

# print( "Hello" ) #Hello 인쇄합니다 print( "Python" )
# print( "World" )

############################################################
# [1-3] 들여쓰기
############################################################

# print('Hello')
#   print("Python")

############################################################
# [1-4] print 함수의 옵션
############################################################

# print( "Hi", "Python" )
# 
# print( "Good", "Python", sep = "***" )
# 
# print( "Hello" )
# print( )
# print( "Python" )
# 
# print( "Welcome", "Python", sep = " ::: ", end = " ")
# print( "World!" )

############################################################
# [1-5] 정수형(int) 상수
############################################################

# print( 12346578901234567890 )
# print( 15, 0b1111, 0o17, 0xf )

# print( True == 1, 5 > 10)

############################################################
# [1-6] 실수형(float) 상수
############################################################

# print( 3.14, -3.14 )
# print( 1e-3, 1e3 )

############################################################
# [1-7] 변수
############################################################

# abc1 = 10
# Abc1 = abc1 + 1
# my_name = 'KIM'
# print('abc1', abc1, 'Abc1', Abc1, 'my_name', my_name)
# abc1 = 20
# print(abc1)

############################################################
# [1-8] 변수의 타입
############################################################

# a, b, c = 10, 3.14, 'hello'
# print( type(a), type(b), type(c) )
# 
# a, b, c = b, c, 100
# print( type(a), type(b), type(c) )

############################################################
# [1-9] 기본 산술 연산자의 이해
############################################################

# a, b = 10, 3
# print( a**4, (-3)**4 )
# print( a+b, a-b, a*b, a/b )
# print( 10//3, 10%3, 2.5//2, 2.5%2 )
# print( 10+20/2, (10+20)/2 )
# 
# print('Hello' + ' ' + 'Python')
# print('Hello' * 2)

############################################################
# [1-10] 자리수 분리
############################################################


# n = 4321
# d1 = n//1000
# d2 = (n - d1*1000) // 100
# d3 = (n - d1*1000 - d2*100) // 10
# d4 = (n - d1*1000 - d2*100 - d3*10) // 1
# print( d1, d2, d3, d4 )

# n = 4321
# d1 = n//1000
# d2 = (n//100) % 10
# d3 = (n//10) % 10
# d4 = n % 10
# print( d1, d2, d3, d4 )


############################################################
# [1-11] 문자열 상수
############################################################

# print( "Hi\nPyth\ton" )
# print( 'It\'s nice' )
# print( "Back Slash => \\" )
# print( r"Back Slash => \\" )
#print( r"Back Slash => \" )

# print( r"Hi\nPyth\ton" )

############################################################
# [1-12] 디렉토리 형식 문자열 인쇄
############################################################

# print( 'C:\temp' )
# print(r'C:\temp' )

############################################################
# [1-13] 타입명
############################################################

# print( type(int) )
# print( type(10) )
# a, b = int(3.14), int('10')
# print( a, type(a), b, type(b) )

############################################################
# [1-14] 데이터 타입(type) 변환
############################################################

# print(str(10), str(3.14), str('apple'))
# print(int(4.89), int('13'), int(-10))
# print(float(5), float('3.14'), float(1.78))
# print(bool(1.5), bool(0.0), bool(True))
#print(str(10)*5)

############################################################
# [1-15] 문자열 정수 연산
############################################################

# a, b = '10', '20'
# print(a+b)
# r = a + b
# print(r)
# a= int(a)
# b= int(b)
# r= a+b
# print(r)
############################################################
# [1-16] 제품 판매가격 계산
############################################################

# p, t = float('123456'), float('12.5')

# # 코드 작성
# total = p + p * t / 100
# print( int(total//1000)*1000 )

# p, t = int('123456'), float('12.5')

# # 코드 작성
# total = p + p * t / 100
# print(total)
# print( (total//1000)*1000 )

# print( int(total//1000)*1000 )

# p, t = int('123456'), float('12.5')

# # 코드 작성
# x = p + p * t / 100

# total = x//1000*1000 

# print( int(total) )

############################################################
# [1-17] 키보드로 입력 및 타입 변환
############################################################

# x = input()
# y = int(input())
# z = float(input())

# print(x, type(x))
# print(y, type(y))
# print(z, type(z))

# x=input("나이 입력하라")
# print(x)

############################################################
# [1-18] 두 정수 입력 받아 합 구하기
############################################################

# # 코드 작성

# a=int(input())
# b=int(input())

# print(a + b)

############################################################
# [1-19] split()을 이용한 이름 3개 입력 받기
############################################################

# a, b, c = input().split()
# print( a, b, c )

############################################################
# [1-20] ,로 분리된 2개의 정수를 한 줄에 입력 받기
############################################################

# a, b = input().split( sep = ',')
# a, b = int(a), int(b)
# print( a + b )

############################################################
# [1-21] 정수 3개를 받아서 합계를 인쇄하는 코드를 설계
############################################################

# # 코드 작성
# a, b, c = input().split( sep = ' ')
# a, b, c = int(a), int(b), int(c)
# s= a + b + c

# print( s )

# a, b, c = input().split()
# a,b,c=int(a),int(b),int(c)
# s=a+b+c
# print(s)

############################################################
# [1-22] format 메서드를 이용한 인쇄
############################################################

# s1 = '{}, {}'.format(10, 20)
# s2 = '{0} + {0} = {2}'.format(2, 3, 2 + 2)
# s3 = 'a = {a}, b = {b}'.format(a = 10, b = 20)
# 
# print(s1, s2, s3, sep = '\n')

############################################################
# [1-23] format 메서드 형식 지정
############################################################

# print('{0:d} 0x{0:x} {0:f}'.format(100))
# print('|{0:5s}|{0:5}|{1:2}|'.format('Hi','Good'))
# print('|{0:5.1f}|{0:05.1f}|'.format(1.23))
# print('|{0:<5}|{0:_^5}|{0:*>5}|'.format('Hi'))
# print('{:,} {:.2%}'.format(1234, 0.245))
# print('{{{}}}'.format(123) )

############################################################
# [1-24] f-prefix를 이용한 다양한 인쇄
############################################################

# name = 'mono'
# age = 20
# f1 = 11.3456

# s = f'{name }, {age-10}'
# print(s)

# s = f'gogo, {age-10}'
# print(s)
# print(f'{f1:9.5f}')
# print(f'name = {name}')
# print(f'{age:>5}-{age:0>5}')
# print(f'{age:<5}-{age:0^5}')
# print(f'{1234567895:,}')
# print(f'{0.125:.3%}')

############################################################
# [2-1] Object, Class, Instance
############################################################

# print(int, type(int))
# 
# x = int(10)
# print(x, type(x))
# 
# y = int('20')
# print(y, type(y))
# 
# print(10, type(10))

############################################################
# [2-2] Object의 요소와 관련된 built-in 함수
############################################################

#print(dir(int), dir(3), sep = '\n')
# print(id(int), id(3))
# print(isinstance(3, int))
# print(isinstance(int, int))
# print(isinstance(int, type))
# a = 3
# print(a is 3, a is not 3)

############################################################
# [2-3] Referencing
############################################################

# print(int.__add__(3,4))
# x = int(3)
# print(x.__add__(4))
# print((3).__add__(4))
# 
# print(str.upper("Hello"))
# x = str("Hello")
# print(x.upper())
# print("Hello".upper()) 

############################################################
# [2-4] 연산자 및 Built-in 함수 Overloading
############################################################

# a = 1 + 2
# b = 'x' + 'y'
# c = 3.4 - 2.5
# 
# d = abs(-10)
# e = abs(-3.8)
# f = round(1234, -2)
# g = round(10.434, 1)
# 
# print(a,b,c,d,e,f,g, sep='\n')
# 
# a = int.__add__(1, 2)
# b = str.__add__('x', 'y')
# c = float.__sub__(3.4, 2.5)
# 
# d = int.__abs__(-10)
# e = float.__abs__(-3.8)
# f = int.__round__(1234, -2)
# g = float.__round__(10.434, 1)
# 
# print(a,b,c,d,e,f,g, sep='\n')

############################################################
# [2-5] Name binding
############################################################

# a = 2020
# b = 2020
# print(id(2020), id(a), id(b))

############################################################
# [2-6] Name space 추적
############################################################

# a = 10
# print(id(a))
# 
# a = a + 1
# b = 10
# print(a, b)
# print(id(a))
# print(id(b))
# 
# print(globals())

############################################################
# [2-7] Augmented assignment 
############################################################

# a = 20
# b = 4
# 
# print(id(a), a)
# a += 1      
# print(id(a), a)
# a -= b     
# print(id(a), a)
# a *= b + 2  
# print(id(a), a)

############################################################
# [2-8] Name resolution 동작 확인 1
############################################################

# x = id(10)
# print(x)
# id, int = 10, 20
# print(id, int)
# print(id(10))

############################################################
# [2-9] 파이썬 Keyword 확인
############################################################

# import keyword
# print(keyword.kwlist)

############################################################
# [2-10] Name 오류
############################################################

# x = y
# a += 1
# print(a, x)

############################################################
# [2-11] Namespace의 name 제거
############################################################

# x = id(10)
# print(x)
# id, int = 10, 20
# print(id, int)
# del id
# del int
# print(id(10))
# del x
# print(x)
# del float

############################################################
# [3-1] Container의 생성
############################################################

# t = (10, 20, 30, 20)
# l = [10, 20, 30, 20]
# s = {10, 20, 30, 20}
# d = {1:2, 'a':10, 'Hello':'Kim'}

# print(type(t), t, len(t), max(t), sum(t))
# print(type(l), l, len(l), min(l), sum(t))
# print(type(s), s, len(s), min(s), sum(s))
# print(type(d), d, len(d))

# t, l, s, d = (), [], set(), {}
# print(t, l, s, d)

# t, l, s, d = (10,), [1], {2}, {1:2}
# print(t, l, s, d)

############################################################
# [3-2] Container의 Item 접근
############################################################

# c = 'Hello'
# t = (1, 3.14, 'name')
# l = [1, 3.14, 'name']
# k = {'id':1, 2:3.14, 'tag':'name'}
# s = {1, 3.14, 'name', 1, 3.14}

# print(c[0], c[1], c[-1], c[-2])
# print(t[0], t[1], t[-1], t[-2])
# print(l[0], l[1], l[-1], l[-2])
# print(k['id'], k[2], k['tag'])
# print(s)

############################################################
# [3-3] Mutable Container의 Item 수정
############################################################

# c = 'Hello'
# t = (1, 3.14, 'name')
# l = [1, 3.14, 'name']
# k = {'id':1, 1:3.14, 'tag':'name'}

# print(c, t, l, k, sep = '\n')

# #c[0] = 'K'
# #t[1] = 5.125
# l[2] = 'score'
# k['id'] = 100
# print(c, t, l, k, sep = '\n')

############################################################
# [3-4] Mutable Container의 Item 추가
############################################################

# l = [1, 3.14, 'name']
# k = {'id':1, 'rate':3.14, 'tag':'name'}
# s = {1, 3, 5, 2}
# 
# print(l, k, s, sep = '\n')
# 
# l.append("song")
# l.insert(1,"lew")
# k['num'] = 200
# s.add(10)
# 
# print(l, k, s, sep = '\n')

# 자습 1-1
# id = 100
# name = 'Kim'
# address = 'Seoul'
# age = 20
# height = 180
# weight = 72

# print(id, name, address, sep =     ' : ' , end =  ' => '  )
# print(age, height, weight, sep =    ', ' )

#자습 1-2
# a, b, c = 10, 3.14, "hello"
# print( type(a), type(b), type(c), sep = '\n' )

#

############################################################
# [3-5] 새치기1
############################################################

# l = ['kim', 'lee', 'moon', 'lew', 'kang', 'song']

# # 코드 작성
# #idx, name = input().split()
# # i=int(idx)
# # l.insert(i-1, name)
# # print(l)

# idx, name = input().split()
# idx=int(idx)
# l.insert(idx-1, name)

# print(l)

# 자습 1-3
# a = 12345
# no = a%10+1
# print(no, 'team')

############################################################
# [3-6] 다중 컨테이너 생성과 아이템 접근
############################################################

# t1 = ((1, 3.14, 'name'), (10,),  ('kim', 30, 5.12))
# t2 = ([1, 3.14, 'name'], 'Yoon', {'a':1, 'b':3.14})
# l1 = [[1, 3.14, 'name'], [10],   ['kim', 30, 5.12]]
# l2 = [(1, 3.14, 'name'), 'Yoon', {'a':1, 'b':3.14}]

# print(t1, t2, sep = '\n')
# print(t1[0][0],     t1[-1][-1])
# print(t2[0][2][3],  t2[2]['b'])

# print(l1, l2, sep = '\n')
# print(l1[0][0],     l1[-1][-1])
# print(l2[0][2][3],  l2[2]['b'])

############################################################
# [3-7] 튜플 pack, unpack
############################################################

# t1 = (1, 2, 3)
# print( type(t1), t1 )
# 
# t2 = 1, 2, 3
# print( type(t2), t2 )
# 
# t3 = "kim", "lee", "lew"
# print( type(t3), t3 )
# 
# t4 = 1, 2, 3
# a, b, c = t4
# print(a, b, c)
# 
# a, b, c = "kim"
# print(a, b, c)

############################################################
# [3-8] swap 구현
############################################################

# a = 10
# b = 20
# print(a, b)

# # swap 코드를 1줄로 작성한다
# a,b = b,a

# print(a, b)


#자습 1-4
# a=input()
# b=input()
# print(a, b, sep=" ")

#자습 1-5
#a=1234
#b=3
#c=str(a)[-b]
#print(c)

############################################################
# [3-9] iterable 타입의 unpack
############################################################

# t1, t2, t3 = (1,2,3)
# l1, l2, l3 = [1,2,3]
# s1, s2, s3 = {1,2,3}
# d1, d2, d3 = {'a':1, 'b':2, 'c':3}
# c1, c2, c3 = 'str'
# print(t1,t2,t3,l1,l2,l3,s1,s2,s3,d1,d2,d3,c1,c2,c3)

############################################################
# [3-10] dict view 메서드
############################################################

# d = {'a':1, 'b':2}
# 
# k = d.keys()
# v = d.values()
# i = d.items()
# 
# print(type(k), k, *k)
# print(type(v), v, *v)
# print(type(i), i, *i)
# 
# a1, a2 = d.keys()
# b1, b2 = d.values()
# c1, c2 = d.items()
# 
# print(a1, a2, b1, b2, c1, c2)

############################################################
# [3-11] 부분 Unpack 옵션 : *
############################################################

# t = (10, 20, 30, 40, 50)
# a, *b = t
# print(a, b)     
# *a, b = t
# print(a, b)     
# a, b, *c, d, e = t
# print(a, b, c, d, e)  
# a, b, c, *d, e, f = t
# print(a, b, c, d, e, f)

############################################################
# [3-12] 일등과 꼴찌만 기억하는 사회
############################################################

# # 코드 작성
# 
#x = input().split()
#first, last=x[0], x[-1]
#print(first, last)  

#x = input().split()
#first, last=x[0], x[len(x)-1]
#print(first, last) 

#x = input().split()
#first, *_, last = x
#print(first, last)  


#자습 1-8
#str=input()
#repeat=input()
#repeat=int(repeat)
#print(str*repeat)

#자습 1-9
#a = int(input())
#b = int(input())
#div=a//b
#re=a%b
#print(div, re, sep=' ')
#print(a//b, a%b, sep=' ')
############################################################
# [3-13] 컨테이너 변환 함수 이해
############################################################

# t1 = (1,2,3,4)
# t2 = ((1,2,3),(4,8),(1,2,3),(6,))
# l1 = [1,2,3,4,4,4,5]
# l2 = [[1,2,3],[4,8],[6],[4,8]]
# 
# a, b, c = str(3.14), str(t1), str(t2)
# d, e    = str(l1),   str(l2)
# print(a, b, c, d, e, sep='\n')
# print()
# 
# t3, t4 = tuple(l1), tuple(l2)
# l3, l4 = list(l1),  list(l2)
# print(t3, t4, l3, l4, sep='\n')

############################################################
# [3-14] 새치기2
############################################################

#t = ('kim', 'lee', 'moon', 'lew', 'kang', 'song')
# 
# # 코드 작성

#idx, name = input().split()
#idx=int(idx)
#l=list(t)
#l.insert(idx-1, name)
#t=tuple(l)

#t = ('kim', 'lee', 'moon', 'lew', 'kang', 'song')
#num, fname = input().split()
#num=int(num)-1
#l=list(t)
#l.insert(num, fname)
#t=tuple(l)



# 
#print(t)



#자습 1-9
#str1, str2 = input().split()
#print(str1+str2)

#자습 1-10
#str, num = input().split()
#num=int(num)
#print(str*num)

#자습 1-11
#car_num=input()
#last = int(car_num[-1])
#if(last==0 or last==5):
#    print('1')
#elif(last==1 or last==6):
#    print('2')
#elif(last==2 or last==7):
#    print('3')
#elif(last==3 or last==8):
#    print('4')
#elif(last==4 or last==9):
#    print('5')


##car_num=input()
##last = int(car_num[-1])
##print(last % 5 + 1)

# 자습 2.17
# h1, h2, h3 = map(float, input().split())
# avg = (h1+h2+h3)/3
# print(avg)
# print(h1-avg, h2-avg, h3-avg)

#자습 2.18
# w, b = map(int, input().split())
# print(w*1000 // b)
# print(w*1000 % b)

#자습 답
# id = 100
# name = 'Kim'
# address = 'Seoul'
# age = 20
# height = 180
# weight = 72

# print(id, name, address, sep = " : "     , end = " => "   )
# print(age, height, weight, sep =   ", "  )


#자습
# a, b, c = 10, 3.14, "hello"
# print( type(a), type(b), type(c), sep = "\n")

#
# a = 12345
# no = a % 10 + 1
# print(no, 'team')

#
# a = 1234
# b = 3
# c = a// (10 ** (b-1)) % 10
# print(c)


#

# a=input()
# b=input()
# print(a,b)

#print(input() + " " + input())

#print(input() , input())

#print(f'{input() input()}')


##
#print(input()*int(input()))

##
# a,b = input()input



############################################################
# [3-15] dict 변환 함수 이해
############################################################

# l1 = [['a',1],['b',2],['c',3]]
# t1 = (('a',10),(1,5),(3.14,'A'))
# 
# x = dict(l1), dict(t1)
# print(*x, sep='\n')
# 
# l2 = [['a',10],('c',20),['c',40]]
# t2 = (['a',10],('a',5),('c',40))
# 
# x = dict(l2), dict(t2)
# print(*x, sep='\n')
# 
# t3 = (((1,2), 'abc'), ((3,4,5), 10))
# print(dict(t3))
# 
# d = dict(a = 10, b = 3.5, xy = 'kim')
# print(d)

############################################################
# [3-16] Lookup Table 활용
############################################################

# n = 10
# t = ('LOW', 'HIGH')
# print(t[n >= 0])
# 
# d = {False : 'LOW', True : 'HIGH'}
# print(d[n >= 0])

############################################################
# [3-17] 과일 코드 출력
############################################################

# s = input()
 
# # # 코드 작성
# #t= {'apple':10, 'mango':12, 'orange':17}
# d= {'apple':10, 'mango':12, 'orange':17}

# print(d[s])

############################################################
# [3-18] range 함수
############################################################

# import sys
# 
# print(range(5))
# print(sys.getsizeof(range(100)))
# print(sys.getsizeof(range(100000000)))

############################################################
# [3-19] range 함수의 속성
############################################################

# a = range(1,5)
# b, c = range(2)
# d, *e, f = a
# 
# print(a[1], b, c)
# print(d, e, f)
# print(a)
# print(*a)
# 
# print(*range(5))
# print(*range(2,5))
# print(*range(0,6,2))
# print(*range(4,-1,-1))

############################################################
# [4-1] 컨테이너의 slot 구조 이해
############################################################

# l = [1,2,3,1]
# 
# print(id(1), id(2), id(3), '', sep = '\n')
# print(*map(id, (l, l[0], l[1], l[2], l[3])), sep = '\n')

############################################################
# [4-2] str 컨테이너의 구조
############################################################

# s = 'AB0A'
# 
# print(*map(id, 'AB0'), '', sep = '\n')
# print(*map(id, (s, *s)), sep = '\n')

############################################################
# [4-3] 다중 컨테이너의 구조 이해
############################################################

# l = [[1,2,3,1],{1,2},1]
# print(*map(id, (l, *l)), sep = '\n')
# print(*map(len, (l, l[0], l[1])))

############################################################
# [4-4] Mutable 컨테이너의 아이템 변경
############################################################

# l = [(1,2,3,4),{5,6},[7,8,9]]
# 
# print(len(l))
# print(*l)
# print(id(l[1]), id(l[2][1]))
# 
# l[1] = 10
# l[2][1] = 20
# 
# print(*l)
# print(id(l[1]), id(l[2][1]))

############################################################
# [4-5] Mutable 컨테이너의 아이템 추가
############################################################

# l = [(1,2,3,4),{5,6},[7,8,9]]
# 
# print(len(l))
# print(*l)
# 
# l.insert(1,10)
# l[2].add(20)
# 
# print(*l)

############################################################
# [4-6] Container의 Multiple Binding
############################################################

# a = [1,2,3,4]
# b = [1,2,3,4]
# c = a
# print(*map(id, (a,b,c)), sep = '\n')
# print(a == b, a == c, a is b, a is c)
# 
# a[0] = 10
# print(a[0], b[0], c[0])    
# print(a == b, a == c, a is b, a is c)
# 
# d = (1,2,3,4)
# e = (1,2,3,4)
# f = d
# print(*map(id, (d,e,f)), sep = '\n')
# print(d[0], e[0], f[0], d is e, d is f)

############################################################
# [4-7] 컨테이너의 +, * 연산
############################################################

# s1 = (1,2)
# s2 = (3,4)
# 
# print(s1 + s2, s1 * 3)
# print('ab' + 'cd', 3 * 'ab')

############################################################
# [4-8] 다중 컨테이너의 +, * 연산
############################################################

# s1 = [[1,2],[3,4]]
# s2 = [[5,6],[7,8]]
# 
# s3 = s1 + s2
# s4 = s1 * 2
# 
# s1[0][0] = 9
# 
# print(s1, s2, s3, s4, sep = '\n')
# print(*map(id,(*s1,*s2,*s3,*s4)), sep = '\n')

############################################################
# [4-9] 다중 컨테이너의 * 연산에 의한 다중 참조
############################################################

# a = [0] * 3
# b = [[0]] * 3
# c = [[0] * 3] * 3
# 
# print(a,b,c, sep = '\n')
# 
# a[0] = 2
# b[0][0] = 3
# c[0][0] = 4
# 
# print(a,b,c, sep = '\n')

############################################################
# [4-10] Slicing 동작의 이해
############################################################

# a = [0, 1, 2, 3, 4, 5, 6]
# b = a[1:3]
# 
# print(a[:], a[2:], a[:5], sep ='\n')
# print(a[1:-2], a[::2], sep ='\n')
# print(a[::-1], a[:3:-2], sep ='\n')
# print(a[3::-1], a[-4:-1], sep ='\n')      
# print(a[:-4:-1], b, b[1:4], sep ='\n')

############################################################
# [4-11] list 연산 및 메서드 이해
############################################################

# l = [1,2]
# print(id(l), l, sep = '\n')
# 
# l.append((-1,'lee'))
# l += (5,'kim')
# l.extend([7,8])
# print(id(l), l, sep = '\n')
# 
# l[:] = [1,2,3,4]
# print(id(l), l, sep = '\n')                
# 
# l[1:3:] = [20,30,40]
# print(id(l), l, sep = '\n')
# 
# l[::2] = ('a','bc','def')
# print(id(l), l, sep = '\n')
# 
# del l[1:3]
# print(id(l), l, sep = '\n')
# 
# del l[:]
# print(id(l), l, sep = '\n')
# 
# l.append('lee')
# l.extend('kim')
# print(id(l), l, sep = '\n')
# 
# l.reverse()
# print(id(l), l, sep = '\n')
# 
# x = l.copy()
# y = l[::-1]
# print(x, y, sep = '\n')
# 
# l.clear()
# print(id(l), l, sep = '\n')

############################################################
# [4-12] list의 copy 메서드와 copy 모듈
############################################################

# import copy
# 
# l1 = [[1,2],[3,4]]
# l2 = l1.copy()
# l3 = copy.copy(l1)
# l4 = copy.deepcopy(l1)
# 
# l1[0][0] = 10
# 
# print(id(l1[0]),l1,sep='\n')
# print(id(l2[0]),l2,sep='\n')
# print(id(l3[0]),l3,sep='\n')
# print(id(l4[0]),l4,sep='\n')

############################################################
# [4-13] in, not in 연산
############################################################

# t = ([1,2,3,1], {1,2}, (1,2,3))
# l = [[1,2,3,1], {1,2}, (1,2,3)]
# s = {1, 3, 5}
# d = {'a':1, 'b':2, 'c':3}
# r = range(1, 5)
# 
# print({1,2} in t, (1,3) in l, 3 not in s, 'a' in d, 3 in r)
# print(('a',1) in d.items(), 2 in d.values(), 'c' in d.keys())

############################################################
# [5-1] 주요 built-in 함수 이해 1
############################################################

# print(abs(-3), abs(-3.8))
# print(pow(20, 3), pow(4, 2, 3))
# 
# a, b = divmod(10,3)
# print(a, b)
# print(divmod(10,3))
# 
# print(max(1,  3.4,  5.7), min(1, -3.4, -5.7))
# print(max([10, 20, -2]),  min('kim', 'kang'))

############################################################
# [5-2] 주요 built-in 함수 이해 2
############################################################

# print(round(3.37), round(3.73), round(-3.37), round(-3.73))
# print(round(3.5),  round(4.5),  round(-3.5),  round(-4.5))
# print(round(1236, -2), round(3.745, 1))

############################################################
# [5-3] eval, exec 함수 
############################################################

# print(eval('1+2'))
# print(eval("'good ' + 'morning'"))
# print(eval('max(1,2,3)'))
# 
# s = '[10, 20, -5]'
# l = eval(s)
# print(min(l))

# s = "print('hello')"
# eval(s)

#eval("a=1")
# exec("a=1")
# print(a)

# exec("a=1")
# exec("if a==1:print('yes')")


############################################################
# [5-4] 컨테이너 관련 built-in 함수 이해
############################################################

# t1 = (1,4,2,3)
# t2 = ((1,2,3),(1,3),(0,))
# l1 = [1,4,2,3]
# l2 = ('kim','ko','han')

# print(len(t1),len(t2),len(t2[0]),len(l1),len(l2),len(l2[0]))
# print(min(t1),max(t2),max(t2[0]),min(l1),max(l2),max(l2[0]))

# print(sum(t1),sum(t1, 10),sum(t2[0]),sum(l1))
# print(sum(t2),sum(l2))

# s1 = sum(t2, ())
# print(s1)

# x1 = sorted(t1)
# print(type(x1), x1)
# print(sorted(t2, reverse = True), sorted(l2))

############################################################
# [5-5] Sequence Type 메서드
############################################################

# t = (1,2,3,4,5,1,2,3)
# 
# print(t.index(3))
# print(t.index(3,2))
# print(t.index(3,3))
# print(t.index(3,2,4))
# print(t.index(3,3,5))
# print(t.index(3,3,100))
# print(t.count(3))
# print(t.count(9))

############################################################
# [5-6] 과일 가격을 알려주세요
############################################################

# s = input()
 
# # # 코드 작성
# #t= {'apple':10, 'mango':12, 'orange':17}
# d= {'apple':10, 'mango':12, 'orange':17}

# print(d[s])



# f = ('apple', 'banana', 'mango', 'pineapple', 'orange')
# p = (1000, 800, 2000, 5200, 400)
# # 
# # # 코드 작성

# f_name = input()
# p_index = f.index(f_name)
# p[p_index]

# #풀이2
# f = ('apple', 'banana', 'mango', 'pineapple', 'orange')
# p = (1000, 800, 2000, 5200, 400)
# print(p[f.index(input())])

############################################################
# [5-7] dict를 이용한 과일 가격 알려주세요
############################################################

# d = {'apple':1000, 'banana':800, 'mango':2000, 'pineapple':5200, 'orange':400}
# # 
# # # 코드 작성

# print(d[input()])


############################################################
# [5-8] 실수 값들을 가까운 정수로 변환하여 인쇄
############################################################

# f = (3.14, -5.625, 100.4, 25.8)
# m = map(round, f)
# print(type(m), m, sep = '\n')
# print(*m)

############################################################
# [5-9] 인자 2개인 함수의 map 함수 사용
############################################################

# v = (10, 4, 2, -10)
# e = (2,  3, 4,  2)

# # # 코드 작성
# def pow(v, e):
#     return v**e

# r = map(pow, v, e)
# print(*r, sep=' ')

############################################################
# [5-10] zip 활용 RBG 이미지 묶기
############################################################

# #내풀이(맞는지 확실히 모름. 모든 케이스 맞는지 의문)
# r = (52, 255, 39, 132)
# g = (19, 63, 227, 197)
# b = (0, 68, 255, 187)

# def hap(r, g, b):
#     return (r, g, b)

# # 코드 작성
# img = list(map(hap, r, g, b))


# print(img)

# #답안
# r = (52, 255, 39, )
# g = (19, 63, 227, 197)
# b = (0, 68, 255, 187)


# # 코드 작성
# img = list(zip(r, g, b))


# print(img)


# #활용
# #답안
# r = (52, 255, 39, )
# g = (19, 63, 227, 197)
# b = (0, 68, 255, 187)


# # 코드 작성
# img = list(zip(r, g, b, strict =True))


# print(img)

############################################################
#  [5-11] dict 형식으로 과일 tag 만들고 가격 출력하기
############################################################

# f = ('apple', 'orange', 'banana', 'mango')
# p = (100, 80, 120, 90)

# # 코드 작성
# #print(tag) #디버깅용
# tag = dict(zip(f, p))
# #print(tag) #디버깅용
# fruit_name = input()
# price = tag[fruit_name]

# print(tag)
# print(price)

############################################################
# [5-12] enumerate 함수 분석
############################################################

# t = ('kim', 'lee', 'park')
# x1 = zip(range(len(t)), t)
# 
# x2 = enumerate(t)
# x3 = enumerate(t, 10)
# 
# print(*x1)
# print(*x2)
# print(*x3)

############################################################
# [5-13] 과일 품목별 일련번호 부여하여 dict로 생성하기
############################################################

##내 enumerate 풀이
# f = ('apple', 'orange', 'banana', 'mango')

# tag = dict(enumerate(f, 1)) # 코드 작성


# print(tag)


## 내 zip 풀이
# f = ('apple', 'orange', 'banana', 'mango')

# a = tuple(range(1,len(f)+1))

# tag = dict(zip(a, f))

# print(tag)


# #답안-1
# f = ('apple', 'orange', 'banana', 'mango')
# tag= dict(zip(range(1,len(f) + 1), f))
# print(tag)

# #답안-2
# f = ('apple', 'orange', 'banana', 'mango')
# tag = dict(enumerate(f,start=1))
# print(tag)


############################################################
# [5-14] 개수가 지정되지 않은 정수들의 합
############################################################

# x = input().split()
# y = map(int, x)
# z = sum(y)
# print(z)
# 
# #print(sum(map(int, input().split())))

############################################################
# [5-15] iterator 타입의 성격
############################################################

# t = map(int, input().split())
# print(sum(t))
# print(sum(t))


## call back 개념
# def mul(a,b):
#     return a*b
# def div(a,b):
#     return a/b

# def func(a,b,f):
#     return f(a,b)

# r = func(3, 4, div)
# print(r)

############################################################
# [5-16] Iterator의 개념 - 한번쓰면 버려진다. 
############################################################

# #x = map(int, [3.14, -5.25, -128])
# x = list(map(int, [3.14, -5.25, -128]))
# y = map(abs, x)

# print('[1]', *x)
# print('[2]', *y)

############################################################
# [5-17] 최대값과 위치 찾기
############################################################

# x = map(int, input().split())

# # 코드 작성
# l = list(x)
# max_val= max(l)
# max_pos= l.index(max_val) + 1

# print(max_val)
# print(max_pos)

############################################################
# [5-18] 리스트로 n개 입력 받아서 최대값 구하기
############################################################

#x = map(int, input().split())
#l = list(x)
#max_val= max(l)
#print(max_val)
#l.append(max_val)
#print(l)


############################################################
# [5-19] n명 이름 중복 제거하기
############################################################

#l = input().split()
#print(len(set(l)))


############################################################
# [5-20] n개 정수 입력 받아 오름차순, 내림차순으로 정렬하기
############################################################

# #x = map(int, input().split())
# #print(sorted(x))
# #print(sorted(x, reverse=True))

# m = map(int, input().split())
# l = list(m)
# print(sorted(l))
# print(sorted(l, reverse=True))

# #잘못된 답 
# m = map(int, input().split())

# print(sorted(m))
# print(sorted(m, reverse=True))

############################################################
# [6-1] 함수의 정의 및 호출
############################################################

# def func1() : print('func1')

# def func2() :
#     print('func2')

# def func3() :
#     print('func3-1')
#     print('func3-2')

# func1()

# def func4() :
#     print('func4-1')
#     return
#     print('func4-2')

# func2()
# func3()
# func4()
# print(func1())

############################################################
# [6-2] 함수의 리턴
############################################################

# print('start')
# 
# def func1() :
#     print('func1-1')
#     return
#     print('func1-2')
#     return None
#     print('func1-3')
# 
# func1()
# print(func1())
# 
# print('stop')

############################################################
# [6-3] 함수의 Parameter
############################################################

# def func1(a) :
#     print('func1', a)
# 
# def func2(a, b) :
#     c = a + b
#     print('func2', a, b, c)
# 
# func1(10)
# func1('kim')
# 
# func2(30, 40)
# func2('kim', 'lew')
# func2([1,2,3], [4,5,6])
# func2('kim', 10)

############################################################
# [6-4] 함수의 값 Return
############################################################

# def func(a) :
#     print(a)
#     return a + 1 

# func(10)
# x = func(20)
# print(x)
# print(func(30))

############################################################
# [6-5] return 식이 여럿인 함수
############################################################

# def func(a, b) :
#     return a + b, a - b, a *  b, a // b

# print(func(10, 3))

############################################################
# [6-6] 문자열 복제기
############################################################

# def string_repeat(s, n) :

#     # 코드 작성
#     x = s*n
    
#     return x

# y = string_repeat('kim', 2)
# print(y)
# print(string_repeat('hello', 3))

# def string_repeat(s, n):
#     x = s*n
    
#     return x

# y = string_repeat('kim', 2)
# print(y)
# print(string_repeat('hello', 3))


############################################################
# [6-7] 함수의 변수 사용
############################################################

# cnt = 0

# def func() :
#     cnt += 1

# func()
# func()

# print(cnt)

############################################################
# [6-8] global 키워드
############################################################

# def f2( ):
#     global a
#     global b
#     a = 10
#     b = 20
#     c = 30 + d
#     print(a, b, c)
# 
# a, c, d = 1, 3, 5
# print(a)
# f2()
# print(a, b, c)

############################################################
# [6-9-1] 함수의 parameter에 immutable argument의 전달
############################################################

# def f1(a) :
#     a = 100
#     print(a)
#     
# a = 10
# 
# f1(a)
# print(a)

############################################################
# [6-9-2] 함수의 parameter에 mutable argument의 전달
############################################################

# def f2(x) :
#     x[0] = 100
#     x.append(200)
#     print(x)
# 
# b = [1,2,3,4]
# 
# f2(b)
# print(b)

############################################################
# [6-10] 전역, 지역 namespace 확인
############################################################

# import pprint as pp
# 
# msg = 'happy'
# 
# def func(a, b) :
#     c = a + b
#     pp.pprint(locals())
#     return c
# 
# print(dir(__builtins__))
# pp.pprint(globals())
# print(func(10, 20))

############################################################
# [6-11] Position or Keyword Parameter(pPK)
############################################################

# def func(a, b): 			#pPK, pPK
#     print('%d, %d' %(a, b))
    
# func(10, 20)            		#aP, aP
# func(a = 10, b = 20)    		#aK, aK
# func(b = 10, a = 20)    		#aK, aK
# func(10, b = 20)        		#aP, aK
# #func(a = 10, 20)       		#aK, aP
# #func(20, a = 10)       		#aP, aK

############################################################
# [6-12] Default pPK Parameter(pPKd) 1
############################################################

# def func(a, b, c = 300, d = 400): 	    #pPK, pPK, pPKd, pPKd
#     print('%d, %d, %d, %d' %(a, b, c, d))
#     
# func(10, 20)                              #aP, aP, (aKd), (aKd)
# func(10, 20, 30)                          #aP, aP, aP, (aKd)
# func(a = 10, b = 20)                      #aK, aK, (aKd), (aKd)
# func(a = 10, b = 20, c = 30, d = 40)      #aK, aK, aK, aK
# func(a = 10, b = 20, d = 40)              #aK, aK, (aKd), aK
# func(10, 20, d = 40)                      #aP, aP, (aKd), aK

############################################################
# [6-13] Default pPK Parameter(pPKd) 2
############################################################

# def func(a, b = 200, c): 		  #pPK, pPKd, pPK
#     print('%d, %d, %d' %(a, b, c))
# 
# func(10, 20, 30)         		  #aP, aP, aP

############################################################
# [6-14] Keyword Only Parameter(pK, pKd) 1
############################################################

# def func(*, a, b = 200, c): 	    #pK, pKd, pK
#     print('%d, %d, %d' %(a, b, c))
#     
# func(a = 10, b = 20, c = 30) 	    #aK, aK, aK
# func(c = 30, b = 20, a = 10) 	    #aK, aK, aK
# func(a = 10, c = 30)         	    #aK, aK
# func(10, 20, 30)            	    #ap, ap, ap

############################################################
# [6-15] Keyword Only Parameter(pK, pKd) 2
############################################################

# def func(a, b = 200, *, c, d = 400, e): 	 #pPK, pPKd, pK, pKd, pK
#     print('%d, %d, %d, %d, %d' %(a, b, c, d, e))
    
# func(10, 20, c = 30, d = 40, e = 50)     	#aP, aP, aK, aK, aK
# func(10, e = 50, c = 30)                	#aP, (aKd), aK, (aKd), aK
# func(e = 50, c = 30, a = 10)            	#aK, (aKd), aK, (aKd), aK

############################################################
# [7-1-1] 사용자 함수
############################################################

# a = 10
# 
# def f1() : print(1)
# def f2() : print(a + 1)
# def f3(x, y) : print(max(x, y))
# def f4(x, y) : return x + y
# 
# f1()
# f2()
# f3(5, 10)
# print(f4(5, 10))

############################################################
# [7-1-2] Lambda 식으로 이름없는 함수 만들기
############################################################

# a = 10
# l1 = lambda : print(1)
# l2 = lambda : print(a+1)
# l3 = lambda x,y : print(max(x,y))
# l4 = lambda x,y : x+y

# l1()
# l2()
# l3(5, 10)
# print(l4(5, 10))

############################################################
# [7-2] Lambda 함수 동작 분석
############################################################

# def sqr(x) :
#     return x ** 2
# 
# y = map(sqr, [1,3,4,7])
# print(*y)
# 
# z = map(lambda x : x ** 2, [1,3,4,7])
# print(*z)

############################################################
# [7-3] tuple로 리턴되는 함수를 lambda 식으로 설계
############################################################

# def func(a, b) : return a+b, a-b, a*b, a/b
# 
# print( func(3,4) )
# 
# f1 = lambda a, b : (a+b, a-b, a*b, a/b)
# f2 = lambda a, b : [a+b, a-b, a*b, a/b]
# print( f1(3, 4) )
# print( f2(3, 4) )

############################################################
# [7-4-1] 다중 container의 대소 비교
############################################################
# def func(x):
#     print(x)
#    # print(x, x[1])
#     return x[1], x[2] # x[1] = 1차 조건, x[2] = x[1]에서 같을 경우 두번째 비교

# t = (('banana', 500, 'yellow'), ('apple', 600, 'red'), ('kiwi', 500, 'brown'))

# min_item = min(t, key = func)
# print('min =', min_item)
# min_item = sorted(t, key = func)
# print('min =', min_item)


############################################################
# [7-4-2] min, max 함수의 비교 대상 지정
############################################################

# def func(x) :
#     print(x, x[1])
#     return x[1]
#     
# t = ((10, 'kim'),(21, 'choi'),(8, 'song'))
# 
# print('min #1 =', min(t))
# print('min #2 =', min(t, key = func))

############################################################
# [7-5] min, max 함수의 비교 대상 지정
############################################################

# def comp1(x) : return x[0]
# def comp2(x) : return x[1]
# def comp3(x) : return x[1], x[2]
#     
# t = (('banana', 500, 'yellow'), ('apple', 600, 'red'), ('kiwi', 500, 'brown'))
# 
# print( min(t, key = comp1), max(t, key = comp1) )
# print( min(t, key = comp2), max(t, key = comp2) )
# print( min(t, key = comp3), max(t, key = comp3) )

############################################################
# [7-6] key로 전달하는 함수를 lambda로 구현
############################################################

#  def comp1(x) : return x[0]
#  def comp2(x) : return x[1]
#  def comp3(x) : return x[1], x[2]
    
# t = (('banana', 500, 'yellow'), ('apple', 600, 'red'), ('kiwi', 500, 'brown'))

# print( min(t, key =  lambda t : x[0]                            ) ) # key = comp1 기능 
# print( min(t, key =  lambda t : x[1]                            ) ) # key = comp2 기능
# print( min(t, key =  lambda t:  x[1], x[2]                           ) ) # key = comp3 기능

############################################################
# [7-7] sorted 함수의 정렬 기준 전달
############################################################

# x = [('apple','red',500),('kiwi','brown',300),('banana','yellow',300)]
# 
# y1 = sorted(x, key = lambda a : a[0], reverse = True)
# y2 = sorted(x, key = lambda a : a[1])
# y3 = sorted(x, key = lambda a : a[2])
# y4 = sorted(x, key = lambda a : (a[2], a[0]))
# 
# print(x, y1, y2, y3, y4, sep = '\n')

############################################################
# [7-8] 입력된 모든 실수 값들을 정수화(round)후 제곱하기
############################################################

# # num = list(map(float, input().split()))
# # num2 = list(map(round,num))
# # result = list(map(lambda x: x**2, num2))
# # print(*result)

# result = map(lambda x: round(float(x)) ** 2, input(). split())
# print(*result)

##
# def sqr(x):
#     return x**2

# m1 = map(float, map(float, input().split()))
# m2 = map(round, m1)
# m3 = map(sqr, m2)
# print(*m3)

##
# def func(x):
#     return round(float(x)) **2

# m = map(func, input().split())
# print(*m)

##
# m = map(lambda x: round(float(x)) **2, input().split())
# print(*m)


############################################################
# [7-9] 오래된 와인을 찾아라
############################################################

# # s = input().split()

# # oldest_wine = min(s, key=lambda x: (x[1:-1], x[0], x[-1]))
# # print(oldest_wine)

# # #print( min(s[1:-2]                            ) )

# # # print( min(t, key =  lambda t : x[0]                            ) ) # key = comp1 기능 
# # # print( min(t, key =  lambda t : x[1]                            ) ) # key = comp2 기능
# # # print( min(t, key =  lambda t:  x[1], x[2]                           ) ) # key = comp3 기능

# ##
# def func(x):
#     #return x[1:-1], x[0], x[-1]
#     return x[1:-1] + x[0] + x[-1]

# x = input().split()
# #r = min(x, key = func)
# r = min(x, key = lambda x: (x[1:-1], x[0], x[-1]))

# print(r)


############################################################
# [7-10] 창고 정리
############################################################

# x = (('x720', 2012, 6), ('x730', 2012, 8), ('y6200', 2013, 1), ('a210', 2012, 8))
# # 코드 작성
# x= sorted(x, key=lambda item : (item[1], -item[2]))
# print(tuple(x))


# # x = (('x720', 2012, 6), ('x730', 2012, 8), ('y6200', 2013, 1), ('a210', 2012, 8))
# # # 코드 작성
# # x= tuple(sorted(x, key=lambda item : (item[1], -item[2])))
# # print(x)

# # x = (('x720', 2012, 6), ('x730', 2012, 8), ('y6200', 2013, 1), ('a210', 2012, 8))
# # # 코드 작성
# # print(tuple(sorted(x, key=lambda item : (item[1], -item[2]))))


###
# x=eval(input())
# # # x = (('x720', 2012, 6), ('x730', 2012, 8), ('y6200', 2013, 1), ('a210', 2012, 8))
# def func(x):
#     return x[1], -x[2]


# #l = sorted(x, key=func)

# print(tuple(l))

###
# x=eval(input())
# # # x = (('x720', 2012, 6), ('x730', 2012, 8), ('y6200', 2013, 1), ('a210', 2012, 8))
# # def func(x):
# #     return x[1], -x[2]


# #l = sorted(x, key=func)
# l = sorted(x, key=lambda x: (x[1], -x[2]) )

# print(tuple(l))

############################################################
# [8-1] 비교 연산
############################################################

# a=10
# b= [] and a
# print(b)

# a, b = 10, 10
# print(a == b, a != b, a < b, a > b, a <= b, a >= b)
# print(0 <= a <10, 0 <= b <= 10)
# 
# a, b, c = 'kim', 'kim', 'kj'
# print(a == b, a != b, a < c, a > c, a <= b, a >= b)
# 
# x, y = 'YES' if a == b else 'NO', 1 if a > c else -1
# print(x, y)
# 
# a = [1,2,3]
# print(3 in a, 2 not in a)
# 
# a, b = [1,2,3], [1,2,3]
# c = a
# print(a is b, a is not c, a[1] is b[1], a[1] is c[1])

############################################################
# [8-2] 3 또는 7의 배수 판별
############################################################
# n = int(input())

# print(n%3==0 or n%7==0)

# n=int(input())
# print(n%3==0 or n%7==0) 

############################################################
# [8-3] all 함수와 any 함수
############################################################

# print(all([True, 1, -1, 1.0, 'str']))
# print(all({True, None, -1, 1.0, 'str'}))
# print(any([None, True, 0, 0.0, '']))
# print(any((False, None, 0, 0.0, '')))

############################################################
# [8-4] Generator Expression
############################################################

# t = (1,-3,7,-2,8)
# 
# a = (x for x in t)
# print(type(a))
# print(*a)
# print(*a)
# 
# b = (x * x for x in t)
# print(*b)
# 
# c = (abs(x) for x in t)
# print(*c)
# 
# d = (print(x) for x in t)
# print(*d)

############################################################
# [8-5] Generator 식에 filter 기능 추가
############################################################

# t = (1,-3,7,-2,8,9)
# 
# a = (x for x in t if x > 0)
# print(*a)
# 
# b = (x * x for x in t if x > 0 and x % 3)
# print(*b)
# 
# c = (x * x for x in t if x > 0 if x % 3)
# print(*c)

############################################################
# [8-6] 한 줄에 입력되는 여러 정수 입력 받기
############################################################

# x = (int(n) for n in input().split())
# print(sum(x))

############################################################
# [8-7-1] 모든 값을 제곱하여 list에 저장하기 => lambda와 map 활용
############################################################

# def func(x):
#     return x**2

# # t = (1, 3, 7, 2, 6, 8)
# # l = list(map(func, t))
# # l = list(map(lambda x: x**2, t))# 코드 작성

# # print(l)


# ###


############################################################
# [8-7-2] 모든 값을 제곱하여 list에 저장하기 => generator expression 활용
############################################################

###
# t = (1, 3, 7, 2, 6, 8)

# l = list((x**2 for x in t)) # 코드 작성
# print(l)

# t = (1, 3, 7, 2, 6, 8)
# l = list(x**2 for x in t)

# print(l)

############################################################
# [8-8] ‘a’로 시작하는 단어의 앞 글자를 ‘*’로 변환하기
############################################################

# 코드 작성
# l = input().split()

# #y = ('*' + x[1:] for x in l  if x[0] == 'a')
# y = (f"*{x[1:]}" for x in l  if x[0] == 'a')
# print(*y)


# f = filter(lambda x : x[0] == 'a', input().split())
# y = map(lambda x: '*' + x[1:] , f)
# print(*y)


############################################################
# [8-9] 2개의 생성식이 사용된 Generator
############################################################

# s1, s2 = 'abc', '1234'
# 
# r = (x + y for x in s1 for y in s2)
# 
# print(*r)

############################################################
# [8-10] 2차원 튜플을 1차원으로 변환
############################################################

# m = ((11,2,33,4),(5,6),(90,10,11,12))
# r = tuple(y for x in m for y in x)
# 
# print(r)
# print(min(r), max(r), sum(r))




############################################################
# [8-11] Comprehension Expression
############################################################

# l = [x for x in range(5)]
# print(type(l), l)
# 
# s = {x * x for x in [1, 2, 3, 3, 4]}
# print(type(s), s)
# 
# t = (('a', 90), ('b', 80), ('c', 95))
# 
# d1 = { x[0] : x[1] for x in t if x[1] > 85 }
# print(type(d1), d1)
# 
# d2 = { k : v for k, v in t if v > 85 }
# print(d2)

############################################################
# [8-12] 귤 판매
############################################################

# n = int(input())
# l= [x for x in map(int, input().split()) if x >=10]

# print(len(l))
# print(*l)

######
# n = int(input())
# m = map(int, input().split())
# f = list(filter(lambda x: x>=10, m))
# print(len(f))
# print(*f)


# n=int(input())
# l = [x for x in map(int, input().split()) if x>=10]

# print(len(l))
# print(*l)

# 여기서 n은 이후 사용되지 않음
# 두 번째줄의 값 들만 입력 받아서 사용하면 됨

# 코드 작성

############################################################
# [8-13] 선별된 귤을 모두 2배하기
############################################################

# n = int(input())

# # 여기서 n은 이후 사용되지 않음
# # 두 번째줄의 값 들만 입력 받아서 사용하면 됨

# # 코드 작성

# l= [x*2 for x in map(int, input().split()) if x >=10]

# print(len(l))
# print(*l)


# #가격 인상 7.7
# # n = float(input())
# # l = map(float, input().split())
# # l = [round(x*(1+n/100)) for x in l]
# # print(*l)

# r = 1 + float(input())/100
# l = input().split()
# g = (round(int(x) * r) for x in l)
# print(*g)

#### 7.8
# # t = tuple(map(int, input().split()))
# # r=int(input())

# # l = [x*2 for x in t if x>=r]
# # print(*l)

# # m = map(int, input().split())
# # r=int(input())

# # l = [x*2 for x in m if x>=r]
# # print(*l)


# # r=int(input())

# # l = [x*2 for x in map(int, input().split()) if x>=r]
# # print(*l)

# # l = input().split()
# # r = int(input())
# # g = (int(x) * 2 for x in l if int(x) >= r)

# m = map(int, input().split())
# r = int(input())
# g = (x * 2 for x in m if x >= r)
# print(*g)

###7.9
# n = int(input())
# d = {k:v for _ in range(n) for k, v in [input().split()]}
# target_id = input()
# print(d[target_id])

# n = int(input())
# d = dict(input().split() for _ in range(n))
# target_id = input()
# print(d[target_id])


###7.10
# # n = int(input())

# # matrix = [list(map(int, input().split())) for _ in range(n)]

# # for row in matrix:
# #     print(row)

# n = input()
# l = [input().split() for i in range(5)]
# print(dict(l)[input()])


###7.11
# # # n = int(input())

# # # counts = [len(input().split()) for _ in range(n)]
# # # print(counts.index(min(counts))+1)

# n = int(input())
# l = [len(input().split()) for _ in range(n)]
# print(l.index(min(l))+1)

# ###7.12
# n=int(input())
# l=[ [int(x) for x in input().split()] for r in range(n) ]
# print(*l, sep='\n')

############################################################
# [8-14] * 연산을 이용한 다차원 List 생성
############################################################

# x = [ [] ] * 4
# print(x)
# x[0].extend((1,2))
# print(x)

# y = [ [0] * 3 ] * 4
# print(y)
# y[0][0] = 1
# print(y)

############################################################
# [8-15] Comprehension을 이용한 다차원 List 생성
############################################################

# x = [ [] for i in range(4) ]
# print(x)
# x[0].extend((1,2))
# print(x)
# 
# y = [ [0 for j in range(3) ] for i in range(4) ]
# print(y)
# y[0][0] = 1
# print(y)

############################################################
# [9-1] if 문
############################################################

# a, b = 10, 20
# 
# if a: print('[1]')
# 
# print('[2]')
# 
# if a != b:
#     print('[3]')
#     
# print('[4]')
# 
# if a > b:
#     print('[5]')
#     print('[6]')
#     
# print('[7]')

############################################################
# [9-2] else 문
############################################################

# a, b = 10, 20
# 
# if a > b: print('[1]')
# else: print('[2]')
# 
# print('[3]')
	
############################################################
# [9-3-1] 여러개의 if 사용
############################################################

# a, b = 10, 20
# 
# if a > b: print('[1]')
# if a < b : print('[2]')
# if a != b : print('[3]')

############################################################
# [9-3-2] elif 여러개의 사용
############################################################

# a, b = 10, 20
# 
# if a > b: print('[1]')
# elif a < b : print('[2]')
# elif a != b : print('[3]')
# else: print('[4]')

############################################################
# [9-4-1] 비워둔 들여쓰기
############################################################

# if True :
#     print('[1]')
# else:
# 
# print('[2]')

############################################################
# [9-4-2] 비워둔 들여쓰기
############################################################

# def func():
# 
# print("[1]")
# print(func())

############################################################
# [9-5-1] pass문 사용
############################################################

# if True :
#     print('[1]')
# else:
#     pass
# 
# print('[2]')

############################################################
# [9-5-2] pass문 사용
############################################################

# def func():
#     pass
# 
# print("[1]")
# print(func())

############################################################
# [9-6] 2,3,5 배수 확인 함수
############################################################

# def compare(num):
#     #코드 작성
#     if num%2==0 :
#         if num%3==0:
#             if num%5==0:
#                 return 2
#             else:
#                 return 3
#         else:
#             return 2
#     elif num%3==0:
#         if num%5==0:
#             return 3
#         else:
#             return 3
#     elif num%5==0:
#         return 5
#     else:
#         return 0
                 

# print('3 =>', compare(3))
# print('62 =>', compare(62))
# print('25 =>', compare(25))
# print('157 =>', compare(157))
# print(compare(15))





# def compare(num):
#     #코드 작성
#     if num%2==0 :
#         return 2
#     elif num%3==0:
#         return 3
#     elif num%5==0:
#         return 5
#     else:
#         return 0
                 



# print('3 =>', compare(3))
# print('62 =>', compare(62))
# print('25 =>', compare(25))
# print('157 =>', compare(157))


############################################################
# [9-7] 학점을 알려주세요 => if문으로 설계
############################################################

# def func(n) :
#     #코드 작성
#     #if n>100 or n<0:
#     if not 0<=n<=100:
#         return "ERROR"
#     elif n>=90:
#         return 'A'
#     elif n>=80:
#         return 'B'
#     elif n>=70:
#         return 'C'
#     elif n>=60:
#         return 'D'
#     else:
#         return 'F'

# print(func(int(input())))

############################################################
# [9-8] 주차요금
############################################################

# # time = int(input())
# # fee=0
# # #코드 작성
# # if time<10:
# #     fee=0
# # elif time>=10 and time<=30:
# #     fee=500
# # else:
# #     fee = 500 + 300 * ((time-1)//10-2)

# # if fee>50000:
# #     fee=50000

# # print(fee)

# time = int(input())
# if time<10:
#     fee=0
# elif time<=30:
#     fee=500
# else:
#     time -= 30
#     fee=500+300*(time//10)*300
#     if time%10>0:
#         fee+=300
#     if fee>50000:
#         fee=50000
# print(fee)

############################################################
# [9-9] for 문의 구성
############################################################	
	
# for i in range(10) :
#     print(i)
# 
# print('end')

# t = ("kim", "lee", "park", "lew")
# for i in range(len(t)) : print(t[i])
# for x in t : print(x)

# l = [(1,2), (3,4), (5,6), (7,8)]
# 
# for x in l :
#     print(x)

############################################################
# [9-10] Target List Unpack
############################################################

# t1 = ((1,2),'AB', ['hello', 100], (3.14, 'pi'))
# t2 = ([1,2,3,4],('kim','lee','park'),(-1, -2))
# 
# for a, b in t1 :
#     print(a, b)
# 
# for a, b, *c in t2 :
#     print(a, b, c)
# 
# for a, *b, c in t2 :
#     print(a, b, c)
# 
# for i, x in enumerate('ABCD') :
#     print(i, x)

############################################################
# [9-11] sum 함수 구현
############################################################

# def my_sum(y) :
#     #코드 작성
#     result=0
#     for num in y:
#         #result=result+num
#         result += num
#     return result

# x = map(int, input().split())
# print(my_sum(x))

############################################################
# [9-12] 이름 위치 
# 모두 찾기
############################################################

# # t = ('kim','lee','park','kim','song','lee')

# # s=input()

# # for i in range(len(t)):
# #     if t[i] == s:
# #         print(i)



# t = ('kim','lee','park','kim','song','lee')

# s=input()

# for idx, name in enumerate(t):
#     if name == s:
#         print(idx) # 그대 인덱스 출력



	
############################################################
# [9-13-1] 귤 판매 시즌2 : comprehensions
############################################################

#n = int(input())
#l=[]
#for x in map(int, input().split()):
#    if x>=10:
#        l.append(x)

#print(len(l))
#print(*l)

############################################################
# [9-13-2] 귤 판매 시즌2 : for
############################################################

# n = int(input())
# x = map(int, input().split())
# box = []
# 
# # 코드 작성
# 
# print(len(box))
# print(*box) 

# n = int(input())
# x = map(int, input().split())
# box = []

# x=list(x)
# for i in range(len(x)):
#     if x[i]>=10:
#         box.append(x[i])
# print(len(box))
# print(*box)

        

############################################################
# [9-14] 이중 for 루프
############################################################

# for i in range(5) :
#     for j in range(5) :
#         print('*', end = '')
#     print('')

############################################################
# [9-15-1] 별 찍기 1
############################################################

#코드 작성

# ##내 틀린 답변
# for i in range(5) :
#     for j in range(i+1) :
#         print('*', end = '')
#     for j in range(4-i):
#         print(' ', end = '')
#     print('')

# for i in range(5) :
#     for j in range(i+1) :
#         print('*', end = '')
#     print('')



############################################################
# [9-15-2] 별 찍기 2
############################################################

#코드 작성
# for i in range(5) :
#     for j in range(5-i) :
#         print('*', end = '')
#     print('')

############################################################
# [9-15-3] 별 찍기 3
############################################################

#코드 작성
# for i in range(5) :
#     for j in range(4-i) :
#         print(' ', end = '')
#     for j in range(i+1) :
#         print('*', end = '')
#     print('')


############################################################
# [9-15-4] 별 찍기 4
############################################################

#코드 작성
# for i in range(5) :
#     for j in range(i) :
#         print(' ', end = '')
#     for j in range(5-i) :
#         print('*', end = '')
#     print('')

############################################################
# [9-15-5] 별 찍기 5
############################################################

#코드 작성
# for i in range(5) :
#     for j in range(4-i) :
#         print(' ', end = '')
#     for j in range(2*i+1) :
#         print('*', end = '')
#     print('')


############################################################
# [9-16-1] 이차원 튜플의 아이템 인쇄 1
############################################################

# # 인덱스 번호를 이용하는 방식
# 
# t = ((1,2,3),(4,5),(6,7,8,9))
# 
# for i in range(len(t)) :
#     for j in range(len(t[i])) :
#         print(t[i][j], end = ' ')



############################################################
# [9-16-2] 이차원 튜플의 아이템 인쇄 2
############################################################

# # iterator 속성을 이용하는 방식
# 
# t = ((1,2,3),(4,5),(6,7,8,9))
# 
# for y in t :
#     for x in y :
#         print(x, end = ' ')

############################################################
# [9-17] 행과 열을 바꿔서 이차원 튜플의 아이템 인쇄
############################################################
		
# t = ((1,2,3,4),(5,6,7,8),(9,10,11,12))

# # 코드 작성
# #i 루프틑 4번. t[0] 길이가 4이기 때문
# #j 루프는 3번. t의 크기가 3이기 때문.

# for i in range(4):
#     for j in range(3):
#         print(t[j][i], end=" ")

# t = ((1,2,3,4),(5,6,7,8),(9,10,11,12))
# for i in range(len(t[0])):
#     for j in range(len(t)):
#         print(t[j][i], end=" ")

# t = ((1,2,3,4),(5,6,7,8),(9,10,11,12))

# t = ((1,2,3,4),(5,6,7,8),(9,10,11,12))
# z=tuple(zip(*t))
# for r in z:
#     for c  in r:
#         print(c, end=" ")


# t = ((1,2,3,4),(5,6,7,8),(9,10,11,12))
# z=tuple(zip(*t))
# for r in z:
#     print(*r, end=" ")

############################################################
# [9-18] break, continue의 동작
############################################################

# for i in range(10) :
#     if i > 7 : break
#     if not i % 3 : continue
#     print(i)
# print('end => ', i)

############################################################
# [9-19] 알밤만 담는 바구니
############################################################

# m, n = map(int, input().split())
# l = []

# # 코드 작성
# if m>n or (m < 0 or n < 0):
#     print("Error")
# else:
#     for i in range(m,n+1) :
#         if len(l)>=10: break
#         if not i % 3 and not i % 5:
#             l.append(i)
#             continue
#     print(len(l))
#     print(*l)



# m, n = map(int, input().split())
# l = []

# # 코드 작성
# if m>n or (m < 0 or n < 0):
#     print("Error")
# else:
#     for i in range(m,n+1) :
#         if i%3 ==0 and i%5==0:
#             l.append(i)
#         if len(l)>=10: 
#             break

#     print(len(l))
#     print(*l)

## 아래코드는 메모리 낭비 비효율
# m, n = map(int, input().split())
# l = []

# # 코드 작성
# if m>n or (m < 0 or n < 0):
#     print("Error")
# else:
#     # for i in range(m,n+1) :
#     #     if i%3 ==0 and i%5==0:
#     #         l.append(i)
#     #     if len(l)>=10: 
#     #         break
#     l = [i for i in range(m,n+1)  if i%3 ==0 and i%5==0]
#     l = l[:10]
#     print(len(l))
#     print(*l)

############################################################
# [9-20] 알밤을 분류하여 담는 바구니
############################################################

# l1 = []
# l2 = []

# m, n = map(int, input().split())

# # 코드 작성
# if m>n or (m < 0 or n < 0):
#     print("Error")
# else:
#     for i in range(m,n+1) :
#         if i%3 ==0 :
#             l1.append(i)
#         elif i%5 == 0: 
#             l2.append(i)
#         else:
#             continue
#     print(len(l1))
#     print(*l1)
#     print(len(l2))
#     print(*l2)


		
############################################################
# [9-21] 소수 판별 함수의 동작
############################################################

# def prime(n):
#     flag = False
#     for i in range(2, n):
#         if not n%i:
#             print('no prime', n)
#             flag=True
#             break
#     #else : print('prime', n)
#     if flag == False:
#         print("prime")    

# prime(2)
# prime(7)
# prime(15)	


# def prime(n):
#     for i in range(2, n):
#         if not n%i:
#             print('no prime', n)
#             break
#     else : print('prime', n)

# prime(2)
# prime(7)
# prime(15)	


############################################################
# [9-22-1] for 문 안의 변수 유의사항
############################################################

# i = 2000
# print('[1]', i)
# 
# for i in [1,2]:
#     print('  [2]', i)
#     i = 200
#     print('  [3]', i)
# print('[4]', i)

############################################################
# [9-22-2] for 문 안의 변수 유의사항
############################################################

# i = 200
# print('[1]', i)
# 
# for i in [1,2,3]:
#     i += 20
#     print('  [2]', i)
# print('[3]', i)

############################################################
# [9-23-1] while 문의 구성 1
############################################################

# a = 0
# 
# while a < 5 :
#     print('[1]', a)
#     a += 1
# print('[2]', a)

############################################################
# [9-23-2] while 문의 구성 2
############################################################

# a = 0
# 
# while a < 5 :
#     if a > 4 :
#         break
#     print('[1]', a)
#     a += 1
# else :
#     print('[2]', a)
# print('[3]', a)

############################################################
# [9-24] while에 의한 무한 루프
############################################################

# i = 0

# while True :
#     print(i)
#     i += 1
# print('EXIT')

############################################################
# [9-25] 조건에 맞는 입력이 들어올 때 까지 입력 받기
############################################################

# 코드 작성
# # while True:
# #     if(input() == 'X'):
# #         break
# #     else:
# #         print("ERROR")

# # print("EXIT")
    
# while not input() == 'X':
#     print("ERROR")
# print("EXIT")

# # 1.  입력이 x가 아닌 동안 반복
# while input() != "X"\:
#     print("ERROR")
# print("EXIT")

# # 2. 입력이 x가 될 때까지 반복
# while not input() == "X":
#     print("ERROR")
# print("EXIT")

# #3. 원하는 조건에서 break
# while True:
#     if input() == 'X':
#         break

#     print("ERROR")

# print("EXIT")

############################################################
# [10-1] list Method 이해
############################################################

# l = [1]
# print(l)
# 
# l.append(4)
# l.insert(1, 5)
# l.append((3, 'KIM'))
# l.extend((6, 'LEW'))
# print(l)
# 
# l.remove(1)
# print(l)
# 
# x = l.pop()
# y = l.pop(2)
# print(x, y)
# print(l)
# 
# l= [1,8,10,4,5]
# print(l)
# l.reverse()
# print(l)
# l.sort()
# print(l)
# l.sort(reverse = True)
# print(l)

############################################################
# [10-2] 전학생 자리 배치
############################################################
  
# a = [1,4,7,10]

# while True:
#     m = int(input())
#     if(m==0):
#         break
#     # 코드 작성
#     for i in range(len(a)):

#         if(m<=a[i]):
#             a.insert(i,m)
#             break
#     else:
#         a.append(m)
#     print(a)


# a = [1,4,7,10]

# while True:
#     m = int(input())
#     if m==0:
#         break
#     # 코드 작성
#     else:
#         for i in range(len(a)):
#             if(a[i]>m):
#                 a.insert(i,m)
#                 break
#         else: 
#             a.append(m)
#     print(a)

# a = [1,4,7,10]

# while True:
#     m = int(input())
#     if m==0:
#         break
#     # 코드 작성
#     else:
#         for i,v in enumerate(a):
#             if(v>m):
#                 a.insert(i,m)
#                 break
#         else: 
#             a.append(m)
#     print(a)


        
#####9과 자습
###9.1



############################################################
# [10-11] set 연산자 및 메서드 동작 이해
############################################################

# t = (1, 3, 5, 5, 7, 9)
# l = [1, 3, 3, 8]
# print(set(t), len(set(t)))
# print(set(t) & set(l))
# print(set(t) | set(l))
# print(set(t) - set(l))
# print(set(t) ^ set(l))
# s = {1,2}
# s.add(-1)
# print(s)

############################################################
# [10-12] 빵을 두 군데서 받은 학생은 모두 몇 명?
############################################################

# x = ('kim', 'lee', 'park', 'song', 'moon', 'lew')
# y = ('min', 'park', 'kong', 'mo', 'lew')

# num=len(set(x) & set(y))
# # 코드 작성

# print( num )

############################################################
# [10-13] 없어진 학생은?
############################################################

# K = int(input())

# for x in range(K):
#     N, M = (int(y) for y in input().split())
#     r = [int(y) for y in input().split()]
     
#     # 코드 작성
#     s=set()
#     for i in range(N):
#         s.add(i+1)
#     s2 = s - set(r)
#     s2 = sorted(s2)
#     print(*s2)

# K = int(input())

# for x in range(K):
#     N, M = (int(y) for y in input().split())
#     r = [int(y) for y in input().split()]
     
#     # 코드 작성
#     s=set()
#     for i in range(N):
#         s.add(i+1)
#     s2 = s - set(r)
#     s2 = sorted(s2)
#     print(*s2)

# K = int(input())

# for x in range(K):
#     N, M = (int(y) for y in input().split())
#     r = [int(y) for y in input().split()]
     
#     # 코드 작성
#     l = sorted(set(range(1,N+1)), )
#     s=set()
#     for i in range(N):
#         s.add(i+1)
#     s2 = s - set(r)
#     s2 = sorted(s2)
#     print(*s2)



############################################################
# [10-15] 문자별 횟수 세기
############################################################

# n = '2378C946C736B8B30B38B478749ZZ928623234234'
# 
# c1 = {}
# 
# for x in set(n):
#     c1[x] = n.count(x)
# 
# c2 = dict(map(lambda x : (x, n.count(x)), set(n)))
# 
# c3 = {x : n.count(x) for x in set(n)}
# 
# print(c1, c2, c3, sep = '\n')

############################################################
# [11-13] try ~ except
############################################################

# try :
#     a = 200
# except NameError :
#    print('NameError 1')
# 
# try :
#     a = b
# except NameError :
#     print('NameError 2')
#     b = 50
#     a = b
# 
# print(a, b)

############################################################
# [11-14-1] 오류 이름이 맞지 않는 경우
############################################################

# try :
#     a = b
# except TypeError : 
#     print('TypeError')
#     b = 50

############################################################
# [11-14-2] Exception: 모든 오류에 대응
############################################################

# try :
#     a = b
# except Exception : 
#     print('Error')
#     b = 50
#     a = b
# 
# print(a, b)

############################################################
# [11-15] Error Object와 오류 내용의 인쇄
############################################################

# try :
#     a = int('3.14')
# except Exception as e :
#     print(type(e))
#     print(type(e).__name__, e)
#     a = int(3.14)
# 
# print(a)

############################################################
# [11-16-1] else
############################################################

# try :
#     a = 10
# except NameError :
#     print('NameError')
#     a += 20
# else :
#     a += 30
#     
# print(a)

############################################################
# [11-16-2] finally
############################################################

# try :
#     a = 10
#     a = b
# except NameError :
#     print('NameError')
#     a = 0
# else :
#     a += 30
# finally :
#     a += 40

# print(a)

############################################################
# [11-17-1] 다양한 오류 대응
############################################################

# n = int(input())
# t = (1, 'kim', 2)
# 
# try :
#     if n == 2 :
#         a = b
#     else :
#         a = t[n] + 1
# except TypeError as e : # 1
#     print(type(e).__name__, e)
#     a = 10
# except NameError as e : # 2
#     print(type(e).__name__, e)    
#     a = 20
# except IndexError as e : # 3
#     print(type(e).__name__, e)    
#     a = 30
# finally :
#     print(a)

############################################################
# [11-17-2] 발생 오류 무시
############################################################

# a = 10
# 
# try :
#     a = b
# except Exception :
#     pass
# 
# print(a)

############################################################
# [11-18] 모듈 import
############################################################

# def add(a, b):
# 	return 'add?'

# import my_module
# print(add(3,4), my_module.add(3,4), my_module.sub(3,4))

# import my_module as mm
# print(mm.add(3,4), mm.sub(3,4))

# import my_module as mm, your_module as ym
# print(mm.add(3,4), mm.sub(3,4))
# print(ym.mul(3,4), ym.div(3,4))

############################################################
# [11-19] 모듈의 특정 이름(name) import
############################################################

# def add(a, b):
#     return 'add?'
# 
# import my_module as mm
# from my_module import add
# 
# print(add(3,4))
# print(mm.add(3,4), mm.sub(3,4))

# from my_module import add, sub
# print(add(3,4), sub(3,4))

# from my_module import *
# print(add(3,4), sub(3,4))

############################################################
# [11-20] Module import와 Name import의 차이
############################################################

# import pprint as pp
# 
# import my_module as mm
# from my_module import add
# 
# pp.pprint(globals())

############################################################
# [11-21] 패키지 import
############################################################

# import my_package.my_module as mm
# print(mm.add(3,4), mm.sub(3,4))
# 
# from my_package import my_module as mm
# print(mm.add(3,4), mm.sub(3,4))
# 
# from my_package.my_module import add, sub
# print(add(3,4), sub(3,4))
# 
# from my_package.my_module import *
# print(add(3,4), sub(3,4))
# 
# import sys
# sys.path.append(r'.\my_package\files')
# 
# import my_module2 as mm2
# sys.path.pop()
# 
# print(mm2.add(3,4), mm2.sub(3,4))

############################################################
# [12-1] 함수를 이용한 마트 셀프 계산기 설계
############################################################

# def mart_calc(x) :
#     global s
#     s += x
# 
# s = 0
# 
# mart_calc(10)
# mart_calc(30)
# 
# print(s)

#===========================================================
# 여럿이 사용하는 마트 셀프 계산기 설계
#===========================================================

# def mart_calc(n, x) :
#     s[n] += x
# 
# s = [0] * 5
# 
# mart_calc(0, 10)
# mart_calc(1, 100)
# mart_calc(0, 30)
# mart_calc(1, 300)
# 
# print(s[0], s[1])

############################################################
# [12-2] class로 만드는 마트 셀프 계산기
############################################################

# class Mart_Calc :
#     s = 0
# 
#     def add(self, x) :
#         self.s += x
# 
# usr1 = Mart_Calc()
# 
# print(type(Mart_Calc))
# print(type(usr1))
# 
# Mart_Calc.add(usr1, 50)
# usr1.add(10)
# 
# print(usr1.s)
# print(Mart_Calc.s)

############################################################
# [12-3] class의 장점
############################################################

# class Mart_Calc :
#     s = 0
# 
#     def add(self, x) :
#         self.s += x
# 
# usr1 = Mart_Calc()
# usr2 = Mart_Calc()
# 
# usr1.add(10)
# usr2.add(100)
# usr1.add(30)
# usr2.add(400)
# 
# print(usr1.s)
# print(usr2.s)

############################################################
# [12-4] Class의 변수의 종류
############################################################

# class CLS :
#     a = 10
# 
#     def f1(self, x) :
#         y = x + 1
#         self.b = y
#         CLS.a += y
#         print(CLS.a, self.b, y)
# 
#     def f2(self, x) :
#         y = x + 100
#         self.b = y
#         CLS.a += y
#         print(CLS.a, self.b, y)        
# 
# c = CLS()
# c.f1(20)
# c.f2(200)
# 
# print(CLS.a, c.b)

############################################################
# [12-5] Class의 Namespace 동작
############################################################

# class CLS :
#     a = 10
# 
#     def f1(self, x) :
#         self.a += x
#         b = self.a
# 
#     def f2(self, x) :
#         self.a += x
#         b = self.a
# 
# c = CLS()
# c.f1(20)
# c.f2(200)
# 
# print(c.a, CLS.a)

############################################################
# [12-6] 초기 값을 갖는 Instance 변수의 생성
############################################################
                
# class Mart_Calc :
# 
#     def add(self, x) :
#         self.s += x
#         return self.s
# 
# usr = Mart_Calc()
# usr.add(30)
# 
# print(usr.s)	

#===========================================================
# Class 변수를 이용한 Instance 변수 초기화
#===========================================================

# class Mart_Calc :
#     s = 0
# 
#     def add(self, x) :
#         self.s += x
# 
# usr = Mart_Calc()
# usr.add(30)
# 
# print(usr.s)	

############################################################
# [12-7] Instance 생성자와 초기화자 재정의
############################################################
                
# class Mart_Calc :
#     def __init__(self, x) :
#         print("__init__")
#         self.s = x
#         
#     def add(self, x) :
#         self.s += x
#         return self.s
# 
# usr = Mart_Calc(10)
# r = usr.add(30)
# 
# print(r, usr.s)

############################################################
# [12-8] 마트 계산기 임대 수량을 관리하기
############################################################
        
# class Mart_Calc :
#     "Mart Self Calculator"
#     cnt, m = 0, "결제할 금액"
# 
#     def __init__(self, x) :
#         self.s = x
#         Mart_Calc.cnt += 1
#         
#     def add(self, x) :
#         self.s += x
#         print(f'{Mart_Calc.m} => {self.s}원')
#         return self.s
# 
# print(Mart_Calc.__doc__)
# 
# usr1 = Mart_Calc(10)
# usr2 = Mart_Calc(30)
# 
# r1 = usr1.add(30)
# r2 = usr2.add(400)
# 
# print(Mart_Calc.cnt, r1, usr1.s, r2, usr2.s)

############################################################
# [12-9] del 명령에 의한 Instance 소멸
############################################################
        
# class Mart_Calc :
#     cnt = 0
# 
#     def __init__(self, x) :
#         self.s = x
#         Mart_Calc.cnt += 1
#         
#     def add(self, x) :
#         self.s += x
# 
# usr1 = Mart_Calc(10)
# usr2 = Mart_Calc(30)
# 
# usr1.add(30)
# usr2.add(400)
# 
# print(Mart_Calc.cnt, usr1.s, usr2.s)
# 
# del(usr2)
# print(Mart_Calc.cnt)

############################################################
# [12-10] 마트 계산기 반납 시 임대 수량을 감소시키려면?
############################################################

# class Mart_Calc :
#     cnt = 0
# 
#     def __init__(self, x) :
#         self.s = x
#         Mart_Calc.cnt += 1
#         
#     def add(self, x) :
#         self.s += x
# 
#     def __del__(self) :
#         Mart_Calc.cnt -= 1
# 
# usr1 = Mart_Calc(10)
# usr2 = Mart_Calc(30)
# 
# r1 = usr1.add(30)
# r2 = usr2.add(400)
# 
# print(Mart_Calc.cnt, usr1.s, usr2.s)
# 
# del(usr2)
# print(Mart_Calc.cnt)

############################################################
# [12-11] Special Method와 연산자 Overloading
############################################################

# a, b = 3, 5
# 
# print(dir(int))
# 
# r1 = a + b
# r2 = int.__add__(a, b)
# r3 = a.__add__(b)
# 
# print(r1, r2, r3)
# 
# print(dir(str))
# 
# r4 = "Hi" + "Pyhhon"
# r5 = str.__add__("Hi", "Pyhhon")
# r6 = "Hi".__add__("Pyhhon")
# 
# print(r4, r5, r6)

############################################################
# [12-12] 연산자와 Built-In 함수 Overloading
############################################################

# class CLS :
#     def __init__(self, x) :
#         self.s = x
# 
#     def __add__(self, x) :
#         return self.s + x
#      
#     def __gt__(self, x) :
#         return self.s > x.s
# 
#     def __abs__(self) :
#         return -self.s
# 
# usr1 = CLS(10)
# usr2 = CLS(-100)
# 
# print(CLS.__add__(usr1, 30))
# print(usr1.__add__(30))
# print(usr1 + 30)
# 
# print(usr1.__gt__(usr2))
# print(usr1 > usr2)
# 
# print(usr2.__abs__())
# print(abs(usr2))

# # # # # # # # # # # # # # # # # # # # # # # # # # # # # 
# [12-13] Child Class 생성과 상속(Inheritance)
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # 

# class Parent_CLS :
#     a = 10
# 
#     def __init__(self) :
#         print("P_CLS")
#         
#     def f(self, x) :
#         print("P_CLS : ", x)
# 
# class Child_CLS(Parent_CLS) :
# 
#     def __init__(self) :
#         print("C_CLS")
#                 
# c1 = Parent_CLS()
# c1.f(10)
# print(c1.a)
# 
# c2 = Child_CLS()
# c2.f(20)
# print(c2.a)

############################################################
# [12-14] Child Class 생성과 상속(Inheritance)
############################################################

# class Mart_Calc :
# 
#     def __init__(self, x) :
#         self.s = x
#         print("Mart_Calc")
#         
#     def add(self, x) :
#         self.s += x
# 
# class New_Calc(Mart_Calc):
# 
#     def __init__(self, x) :
#         super().__init__(x)
#         
#     def sub(self, x) :
#         self.s -= x
#         
# usr1 = New_Calc(10)
# usr1.add(10)
# usr1.sub(40)
# 
# print(usr1.s)

############################################################
# [12-15] Method Overriding
############################################################

# class Mart_Calc :
#     s = 10
# 
#     def __init__(self, x) :
#         self.s = x
#         
#     def add(self, x) :
#         self.s += x
# 
# class New_Calc(Mart_Calc):
#     s = 20
# 
#     def __init__(self, x) :
#         super().__init__(x)
#         
#     def add(self, x) :
#         print('add')
# 
# print(New_Calc.mro())        
# 
# usr1 = New_Calc(10)
# usr1.add(30)
# 
# print(Mart_Calc.s, New_Calc.s)

############################################################
# [12-16] 여러 부모 Class로 부터 상속 받는 다중 상속
############################################################

# class Father :
#     def f1(self) :
#         print("Father f1")
# 
#     def f2(self) :
#         print("Father f2")
# 
# class Mother :
#     def f1(self) :
#         print("Mother f1")
# 
#     def f3(self) :
#         print("Mother f3")
#         
# class Son(Father, Mother) :
#     pass
# 
# c = Son()
# print(Son.mro())
# 
# c.f1()
# c.f2()
# c.f3()

############################################################
# [12-17] Class method, Static method
############################################################

# class My_CLS :
#     s = 0
#     
#     @classmethod
#     def c_method(cls) :
#         print("c_method :", cls.s)
# 
#     @staticmethod
#     def s_method() :
#         print("s_method :", My_CLS.s)
#         
# c = My_CLS()
# 
# My_CLS.c_method()
# c.c_method()
# My_CLS.s_method()
# c.s_method()



######4과 자습##########

# #4-1
# x = [0]*int(input())
# print(x)

# #4-2
# x = input().split(',')
# x.reverse()
# print(*x, sep='-')

# # 4-3

# n = list(map(int, input().split()))
# m = int(input())

# print(m in n)

# 코드 작성


# # 4-4

# n = list(map(int, input().split()))
# m = int(input())
# if m in n:
#     print('GOOD')
# else:
#     print('BAD')



##4.11
# s = input()
# print(len(s))
# print(100*(len(s)//10))



# #4.12
# # x=input()
# # print(len(x))

# x=input()
# print(len(list(x)))

# # #4.13
# names = input().split()
# # print(min(names),max(names))
# #l = (sorted(x))
# #print(l[0], l[-1])
# #a, '*_', b = sorted(x)

# #4.14
# float_heights=list(map(float, input().split()))
# print(*sorted(float_heights, reverse=True))
# print(max(float_heights), min(float_heights))

# float_heights=map(float, input().split())
# y= sorted(x, reverse=True)
# print(*y)
# print(y[0], y[-1])

# #4.15
# l=map(int, input().split())
# print(l)

# #4.16
# l=list(map(int, input().split()))
# min_index = l.index(min(l))
# sub_list = l[min_index +1:]
# sub_max = max(sub_list)
# ans = sub_list.index(sub_max) + 1
# print(ans)

# # #4.16
# x = tuple(map(int, input().split()))
# minv = min(x)
# maxv = max(x)
# a = x.index(minv)
# b = x.index(maxv, a+1)
# print(b-a)

# #4.16
# s = input().split()
# w = input()

# print(s.count(w))


# # #4.16
# s=input()
# w=input()
# print(s.count(w))


# # #4.16
# l=input().split
# w=input()
# print(l.count(w))


# #4.17
# # t = ((34,70,92),(90,95,100),(55,66,77),(88,66,92),(0,90,88))
# # # 코드 작성
# # my_sum_t = (sum(t[0])+5, sum(t[1])+5, sum(t[2])+5, sum(t[3])+5, sum(t[4])+5)
# # print(my_sum_t)
# # print(min(my_sum_t), max(my_sum_t))

# t = ((34,70,92),(90,95,100),(55,66,77),(88,66,92),(0,90,88))
# # 코드 작성

# def add_bonus(scores):
#     return sum(scores) + 5

# scores = list(map(add_bonus, t))
# #scores = tuple(map(add_bonus, t))
# #scores = set(map(add_bonus, t))
# print(min(scores), max(scores))
# #print(scores)

# # #4.17
# t = ((34,70,92),(90,95,100),(55,66,77),(88,66,92),(0,90,88))
# st=  [5] * len(t) #(5,5,5,5,5)
# l=sorted(map(sum,t, st))
# print(l[0],l[-1])

#(5,) * len(t)

# # #4.17
# s=input().split()
# v=map(int,input().split())
# z = zip(s,v)
# d = dict(z)
# print(d[input()])

# # #4.17
# print(dict(zip(input().split(),map(int,input().split())))[input()])






# #4.18
# t = ('camera', 'TV', 'computer', 'smart phone')
# # 코드 작성

# num=int(input())
# num_idx=num-1
# print(t[num_idx])

# # #4.18
# t = ('camera', 'TV', 'computer', 'smart phone')
# n= int(input())
# print(t[n-1])

# # 4.19
# d = {'kim':80, 'lee':75, 'park':89.3, 'song':72, 'lew':90}
# student_name = input()

# if student_name in d:
#     print(d[student_name])
# else:
#     print("해당 학생이 없습니다.")
############################################################




# #4.20

# x=list(map(int, input().split()))

# remain = x[2:-2]

# print(sum(remain))

# # #4.20

# m=map(int, input().split())
# a, b, *c, d, e = m
# print(sum(c))

# # #4.20

# t=tuple(map(int, input().split())) # 리스트보단 튜플이 더 가벼워서 튜플로 만듬. 
# print(sum(t[2:-2]))

# #4.21

# # a, b = map(int, input().split())
# # total=(a+b)*(b-a-1)/2
# # print(int(total))

# a, b = map(int, input().split())
# total= sum(range(a+1, b))
# print(total)


# #4.21

# a, b = map(int, input().split())
# r = range(a+1, b)
# print(sum(r))


# # 4.22
# n=int(input())

# print(sum(range(0, 3*(n-1)+1, 3)))

# # # 4.22
# n=int(input())
# r=range(0,n*3,3)
# print(sum(n))

# # 4.23
# n=set(map(int, input().split()))
# #print(n)
# print(sum(n))


# #4.24
# d = {'kim' : 34000, 'lee' : 12000, 'park' : 1200, 'lew' : 0, 'song' : 3420}
# # 코드 작성
# print(sum(d.values()))

# #4.25
# s = input().split()
# o, n = input().split()

# if o in s:
#     index = s.index(o)
#     s[index] = n
#     print(*s)

# #4.25
# l = input().split()
# o, n = input().split()
# p = l.index(o)
# l[p] = n
# print(*l)


# # #4.25
# s=input()
# o, n = input().split()
# p=s.index(o)
# print(s[:p] + n+s[p+len[o]:])


# #4.17
# cars_name = input().split()
# price = list(map(int, input().split()))

# #print(cars_name, price, sep='\n')
# car_idx = cars_name.index(input())
# print(price[car_idx])

# #5.2
# def check_team(id) :
#     # 코드 작성
#     return id[-1]
    

# n = int(input())
# n = str(n)
# print(check_team(n))


##5.2
# def check_team(id) :
#     # 코드 작성
#     return id%10
# n = int(input())
# print(check_team(n))


# #5.3
# def find_gem(box, gem) :
#     return box.count(gem)

# n = list(map(int, input().split()))
# x = int(input())
# print(find_gem(n, x))


# #5.3
# def find_gem(box, gem) :
#     return tuple(box).count(gem)

# n = (map(int, input().split()))
# x = int(input())
# print(find_gem(n, x))

# #5.4
# def score(x) :
#     # 코드 작성

#     return (round(sum(x) / len(x), 2), max(x))
    
# n = list(map(int, input().split()))
# print(score(n))

# #5.4
# def score(x) :
#     # 코드 작성
#     t=tuple(x)
#     return (round(sum(t) / len(t), 2), max(t))
    
# n = (map(int, input().split()))
# print(score(n))



# #5.5
# def func(n) :
#     # 코드 작성
#     global total
#     total=total+n
#     return total

# total = 0
# # 아래 부분은 절대 수정하지 말 것
# x = map(int, input().split())
# y = map(func, x) 
# print(*y)

# #5.5

# s = 0
# def func(n) :
#     # 코드 작성
#     global s
#     #s = s + n # global 안해주면 언바운드 로컬 에러 발생
#     s=s+n
#     return s
    

# # 아래 부분은 절대 수정하지 말 것
# x = map(int, input().split())
# y = map(func, x) 
# print(*y)


# # 5.6
# def clean(x) :
#     # 코드 작성
#     global bin
#     bin.append('('+x+')')
#     # bin.append(x)


# bin = []
# for y in input().split() :
#     clean(y) # cup dish can toy radio pen
#     print(bin)

# # 5.6
# def clean(x) :
#     # 코드 작성
#     global bin
#     bin.append('('+x+')')
#     # s=f'({x})' 방식의 방법도 있음


# bin = []
# for y in input().split() :
#     clean(y) # cup dish can toy radio pen
#     print(bin)


# #5.7
# # 함수 작성
# def func(s_original, s_additional = '*'):
#     return s_additional + s_original + s_additional


# # 아래 코드는 수정하지 말 것
# s, x = input().split()
# print(func(s, x))
# print(func(s))


# #5.7
# # 함수 작성
# def func(s, x='*'):
#     #return x + s + x
#     return f"{x}{s}{x}"


# # 아래 코드는 수정하지 말 것
# s, x = input().split()
# print(func(s, x))
# print(func(s))

#6.5
# x = (('x720', 2012, 6), ('x730', 2012, 8), ('y6200', 2013, 1), ('a210', 2012, 8))
# # 코드 작성
# x= sorted(x, key=lambda item : (item[1], -item[2]))
# print(tuple(x))


# x = (('x720', 2012, 6), ('x730', 2012, 8), ('y6200', 2013, 1), ('a210', 2012, 8))
# # 코드 작성
# x= tuple(sorted(x, key=lambda item : (item[1], -item[2])))
# print(x)

# x = (('x720', 2012, 6), ('x730', 2012, 8), ('y6200', 2013, 1), ('a210', 2012, 8))
# # 코드 작성
# print(tuple(sorted(x, key=lambda item : (item[1], -item[2]))))









############################################################
# [7-6] key로 전달하는 함수를 lambda로 구현
############################################################

#  def comp1(x) : return x[0]
#  def comp2(x) : return x[1]
#  def comp3(x) : return x[1], x[2]
    
# t = (('banana', 500, 'yellow'), ('apple', 600, 'red'), ('kiwi', 500, 'brown'))

# print( min(t, key =  lambda t : x[0]                            ) ) # key = comp1 기능 
# print( min(t, key =  lambda t : x[1]                            ) ) # key = comp2 기능
# print( min(t, key =  lambda t:  x[1], x[2]                           ) ) # key = comp3 기능
